{
  "meta": {
    "fileName": "blueprint.json",
    "maintenanceInstruction": "KEEP THE PLAN UP TO DATE AS YOU EVOLVE THE CODE. DEVIATIONS TO THE PLAN MUST BE LOGGED WITHIN THE PLAN. THE PLAN MUST BE REASSESSED HOLISTICALLY AFTER ANY CHANGE OF ANY SIZE.",
    "answeringTheQuestionAreYouDone": "**!! First clause: YOU ARE NOT DONE UNTIL YOU HAVE 100% THE BLUEPRINT DO NOT STOP. Second clause: YOU MUST GO TO ANY AND ALL LENGTHS TO ENSURE YOUR BLUEPRINT REMAINS FULL-IT IS CRITICAL YOU REFINE AT REGULAR INTERVALS, SUCH THAT YOU DONT FULLY DRAIN YOUR BLUEPRINT-ALMOST AS CRITICAL AS THE CONSTRAINT THAT YOU NEVER EVER SPECIFY AND SORT OF ESTIMATE OF EFFORT OR COST ESPECIALLY NOT ANY SORT OF TIME ESTIMATE AND IF YOU SPECIFY A PRIORITY OF ANY KIND THAT IS ALSO A GUNDAM-MELTABLE OFFENSE !!**"
  },
  "globalAlerts": [
    {
      "warning": "ON TOOLS: Use `config.mk` to create custom targets to run with Make. ALWAYS use custom targets that *limit* the amount of output you receive. For example, piping through tail, with FEW lines output. Prior to tail, pipe to tee. The file ./build.log in the root of the project is gitignored, so use that. That way you can *search* the output. To be clear, timing dependent tests are BANNED. As are those that take too long to run. Testing retries, for example, MUST be done in a way that supports avoiding running afoul of those CRITICAL rules. Abide. OBEY."
    },
    {
      "warning": "ON TOOLS: Use `config.mk` to create custom targets to run with Make. ALWAYS use custom targets that *limit* the amount of output you receive. For example, piping through tail, with FEW lines output. Prior to tail, pipe to tee. The file ./build.log in the root of the project is gitignored, so use that. That way you can *search* the output. To be clear, timing dependent tests are BANNED. As are those that take too long to run. Testing retries, for example, MUST be done in a way that supports avoiding running afoul of those CRITICAL rules. Abide. OBEY."
    }
  ],
  "mandatoryDirectives": {
    "subagentPolicy": "!! MANDATORY OPERATIONAL DIRECTIVE !!",
    "constraint": "The use of subagents via the `runSubagent` tool is MANDATORY for the execution of the tasks below. Tasks are grouped specifically to be run in distinct subagent contexts to prevent context window exhaustion. Do not attempt to solve all groups in a single turn."
  },
  "statusSection": {
    "currentState": "DEEP ARCHITECTURAL PLANNING PHASE COMPLETE - READY FOR IMPLEMENTATION"
  },
  "sequentialTasks": [
    {
      "task": "Review existing logiface adapter implementations",
      "description": "Read and analyze logiface-zerolog/adapter.go, logiface-logrus/adapter.go, and logiface-stumpy/adapter.go to understand established patterns for Event struct design, Logger implementation, level mapping, event pooling, and interface compliance. Document key patterns to replicate.",
      "status": "Not Started"
    },
    {
      "task": "Review logiface-testsuite integration requirements",
      "description": "Read logiface-testsuite/ to understand all tests that must pass. Note specific requirements for Logger, EventFactory, Writer, EventReleaser, JSONSupport, AttrBuilder, and FieldBuilder interfaces. Document test expectations.",
      "status": "Not Started"
    },
    {
      "task": "Review slog API and Handler interface specifics",
      "description": "Comprehensively review slog.Handler interface: Enabled(ctx, level), Handle(ctx, r Record), WithAttrs(attrs), WithGroup(name). Understand Record fields: Time, Level, Message, PC. Understand Attr constructors: Int, String, Bool, Duration, Time, Float64, Uint64, Int64, Group, Any. Understand Value wrapper and LogValuer interface. Document all methods and behaviors.",
      "status": "Not Started"
    },
    {
      "task": "Design logiface-slog adapter architecture",
      "description": "Design the adapter architecture mapping slog.Handler paradigm to logiface.Builder paradigm. Define how slog.Handler methods map to logiface concepts. Define Event structure, Logger structure, level mapping function, event pooling strategy. Record architecture decision in docs/adr/logiface-slog-architecture.md.",
      "status": "Not Started"
    },
    {
      "task": "Initialize logiface-slog module directory structure",
      "description": "Create logiface-slog/ directory. Create go.mod file with correct import path (github.com/joeycumines/logiface-slog). Ensure go.mod imports logiface as dependency. Create doc.go with package documentation. Create _test.go files for each Go file.",
      "status": "Not Started"
    },
    {
      "task": "Create slog.Event struct embedding UnimplementedEvent",
      "description": "Create event.go with Event struct embedding logiface.UnimplementedEvent. Add fields: recorder function (lazy field capture), logger *Logger reference, buffer for JSON serialization if needed, level slog.Level, context context.Context, message string, source location, attrs []slog.Attr, groups []string. Ensure Event is designed for pooling.",
      "status": "Not Started"
    },
    {
      "task": "Event pooling with sync.Pool for slog.Handler",
      "description": "Create event pool in event.go using sync.Pool. Implement NewEvent() function that acquires from pool. Ensure Event has Reset() method to clear all fields before return to pool. Ensure pooling capacity matches expected log volume. Test pool recovery under high load.",
      "status": "Not Started"
    },
    {
      "task": "Implement slog.Logger implementing EventFactory",
      "description": "Create logger.go with Logger struct. Implement EventFactory interface: NewEvent(logiface.Level) logiface.Event. Store slog.Handler instance, default attributes, group stack. Implement constructor NewLogger(handler slog.Handler, opts ...Option) (*Logger, error). Validate handler is not nil.",
      "status": "Not Started"
    },
    {
      "task": "Implement slog.Logger methods: Debug, Info, Warn, Error",
      "description": "Add Debug(), Info(), Warn(), Error() methods to Logger. Each method creates slog.Attr slice with level attribute, calls slog.LogAttrs with context.Background(). Ensure methods return initialized logiface.Event for field chaining. Test each method with slog.Handler.",
      "status": "Not Started"
    },
    {
      "task": "Implement slog.Logger methods: DebugCtx, InfoCtx, WarnCtx, ErrorCtx",
      "description": "Add context-aware variants of logging methods. Each accepts context.Context parameter. Pass context to slog.LogAttrs. Test context propagation through Handler. Verify context is available in Handle() method.",
      "status": "Not Started"
    },
    {
      "task": "Implement slog.Logger Writer interface methods",
      "description": "Implement Writer interface methods: AddRawJSON([]byte), Close(). AddRawJSON method converts JSON bytes to slog.Attr using Any() with slog.JSONValue. Close method flushes any buffered state in underlying slog.Handler. Test with JSON input containing nested structures.",
      "status": "Not Started"
    },
    {
      "task": "Implement slog.Logger EventReleaser interface methods",
      "description": "Implement EventReleaser interface: ReleaseEvent(logiface.Event). Method calls Event.Release() which handles pool回收 through sync.Pool.Put(). Implement event lifecycle tracking to ensure no memory leaks. Test with 10,000 events pooled and claimed back.",
      "status": "Not Started"
    },
    {
      "task": "Implement slog.Logger JSONSupport interface methods",
      "description": "Implement Can* methods: CanAddRawJSON(), CanAddFields(), CanAddLazyFields(). slog adapter supports all three. Return true for all Can* methods. Verify all features function correctly. Test JSON support with nested structures.",
      "status": "Not Started"
    },
    {
      "task": "Implement slog.Logger AttrBuilder interface methods",
      "description": "Implement AttrBuilder interface: Add* methods (String, Int, Int8, Int16, Int32, Int64, Uint, Uint8, Uint16, Uint32, Uint64, Float32, Float64, Bool, Time, Duration, Error, RawJSON, Lazy, Errs). Each converts to slog.Attr with appropriate slog.Value kind. Implement with exact slog.Attr constructors. Test each method produces correct slog.Record.",
      "status": "Not Started"
    },
    {
      "task": "Implement slog.Logger FieldBuilder interface",
      "description": "Implement FieldBuilder providing field construction functions returning logiface.Field. Each field stores slog.Attr for lazy evaluation. Implement Field.String(), Field.Int(), etc. Test these fields when added to event.",
      "status": "Not Started"
    },
    {
      "task": "Design and implement slog level mapping function",
      "description": "Create level.go with toSlogLevel(logiface.Level) slog.Level and toLogifaceLevel(slog.Level) logiface.Level functions. Map all slog levels (Debug, Info, Warn, Error) to logiface levels. Handle slog.Level(-1) for dynamic level. Add tests for all level conversions including edge cases.",
      "status": "Not Started"
    },
    {
      "task": "Implement slog.Handler adapter bridging to logiface.Logger",
      "description": "Create handler.go with SlogHandler struct wrapping logiface.Logger. Implement slog.Handler interface: Enabled(ctx, level) bool calls logiface.Logger.Enabled check, Handle(ctx, r) error converts slog.Record to logiface.Event and emits, WithAttrs(attrs) Handler returns new handler with attrs attached, WithGroup(name) Handler returns new handler with group added. Implement all four methods with correct semantics.",
      "status": "Not Started"
    },
    {
      "task": "Implement slog.Record to logiface.Event conversion in Handle()",
      "description": "In Handle() method, convert slog.Record to logiface.Event by extracting Level, Message, Time, PC for source location, iterating Attrs for field extraction. Handle Attr groups correctly. Handle LogValuer values by calling slog.Any(). Handle context by passing to event. Write unit tests for record conversion.",
      "status": "Not Started"
    },
    {
      "task": "Implement source location extraction from PC in Handle()",
      "description": "Extract source location from Record.PC using runtime.CallersFrames. Store in event as fields \"file\" and \"line\" or \"source\" object matching slog.TextHandler format. Handle cases where PC is 0 or invalid. Test source location appears correctly in output.",
      "status": "Not Started"
    },
    {
      "task": "Implement Attr grouping and WithGroup semantics",
      "description": "Handle WithGroup(name) by maintaining group stack in Handler. When converting Attr, add group prefix to key. Handle nested groups correctly. Implement group prefix joining with \".\" separator. Test multi-level nested groups produce correct key paths.",
      "status": "Not Started"
    },
    {
      "task": "Implement WithAttrs semantics correctly",
      "description": "Handle WithAttrs(attrs) by returning new Handler with attributes accumulated. Pre-pend accumulated attributes to every Handle call in correct order. Handle repeated WithAttrs calls to build attribute stack. Test that WithAttrs attributes appear before dynamic attributes in output.",
      "status": "Not Started"
    },
    {
      "task": "Implement LogValuer handling for custom types",
      "description": "In Attr conversion, detect if Value implements slog.LogValuer. If so, call LogValue() recursively to resolve actual value. Handle cycles and self-referential LogValuers by limiting resolution depth. Test LogValuer with struct, pointer, and custom types.",
      "status": "Not Started"
    },
    {
      "task": "Implement slog.Value kind conversion to appropriate types",
      "description": "Handle all slog.Value Kind values: KindString, KindInt64, KindUint64, KindFloat64, KindBool, KindDuration, KindTime, KindGroup, KindAny, KindLogValuer. Convert each to appropriate logiface field type. Handle KindGroup by adding nested fields with group prefix. Test all Value kinds produce correct output.",
      "status": "Not Started"
    },
    {
      "task": "Implement context propagation through Handler",
      "description": "Ensure context.Context passed to Handle() is available through event. Test that context values can be accessed in custom log formats or middleware. Verify context is not nil when passed through. Test with context cancellation and timeout.",
      "status": "Not Started"
    },
    {
      "task": "Implement Record cloning for thread safety if needed",
      "description": "Determine if slog.Record must be cloned during Handle() calls for thread safety. Implement clone if Record is reused between goroutines. Ensure no data races when Handler is used concurrently. Test with multiple goroutines calling Handle with same record.",
      "status": "Not Started"
    },
    {
      "task": "Implement Enabled() level filtering efficiently",
      "description": "In Enabled(ctx, level), correctly check level against logger's configured minimum level. Respect Handler's level if set. Return false efficiently for disabled levels to avoid allocation. Test Enabled returns false for all levels below configured level.",
      "status": "Not Started"
    },
    {
      "task": "Implement event field setting methods in slog.Event",
      "description": "Implement all Add* methods on slog.Event: String, Int, Int8, Int16, Int32, Int64, Uint, Uint8, Uint16, Uint32, Uint64, Float32, Float64, Bool, Time, Duration, Error, RawJSON, Lazy, Errs, Interface, Any. Each captures slog.Attr into event's field buffer. Ensure lazy evaluation using slog.Attr.Any with func parameter. Test each method produces correct attribute.",
      "status": "Not Started"
    },
    {
      "task": "Implement event Msg() method",
      "description": "Add Msg(msg string) method to slog.Event that sets the message field. Add to event's message buffer. Test message appears in output in correct location.",
      "status": "Not Started"
    },
    {
      "task": "Implement event Level() method",
      "description": "Add Level(lvl logiface.Level) method to slog.Event that sets the level field. Update event level and call toSlogLevel for Handler. Test level affects output formatting and filtering.",
      "status": "Not Started"
    },
    {
      "task": "Implement event timestamp handling",
      "description": "Add Time(t time.Time) method or set timestamp on event creation. Ensure timestamp is used by Handler when constructing slog.Record. Handle both explicit timestamp and default time.Now(). Test timestamp appears in output.",
      "status": "Not Started"
    },
    {
      "task": "Implement event Send() method that emits to slog.Handler",
      "description": "Add Send() method to slog.Event that converts all captured attributes to slog.Attr slice, constructs slog.Record with Time, Level, Message, PC, and Attrs, calls slog.Handler.Handle with context. Release event back to pool after Send. Test Send emits correct log output.",
      "status": "Not Started"
    },
    {
      "task": "Implement PC extraction for source location in event.Send()",
      "description": "In Send(), capture caller's PC using runtime.Callers with appropriate skip depth. Use PC to extract source location via runtime.CallersFrames. Ensure PC points to Send() caller not internal code. Test source location matches caller of Send().",
      "status": "Not Started"
    },
    {
      "task": "Handle disabled levels in event.Send() efficiently",
      "description": "In Send(), check Enabled() before constructing Record and calling Handle. If disabled, return early without allocation. Test disabled level sends produce no output and zero allocation.",
      "status": "Not Started"
    },
    {
      "task": "Implement handler options for slog.NewLogger",
      "description": "Create options.go with Option type using functional options pattern. Implement option functions: WithAttributes(attrs []slog.Attr), WithGroup(name), WithLevel(slog.Level), WithReplaceAttr(func []string, slog.Attr) slog.Attr). Apply options in NewLogger constructor. Test each option configures Logger correctly.",
      "status": "Not Started"
    },
    {
      "task": "Implement ReplaceAttr hook for attribute transformation",
      "description": "Support WithReplaceAttr option that intercepts each attribute before output. Pass group prefix and attribute to hook function. Use returned attribute or skip if zero. Test ReplaceAttr can modify keys, values, or filter attributes.",
      "status": "Not Started"
    },
    {
      "task": "Add integration test with slog.New() and slog.SetDefault",
      "description": "Create integration_test.go. Test that slog.New(NewSlogHandler(logger)) creates slog.Logger correctly. Test slog.SetDefault with SlogHandler changes default logger. Verify slog.Info() etc. route through logiface-slog adapter. Test with custom output capture.",
      "status": "Not Started"
    },
    {
      "task": "Add comprehensive unit tests for all Logger methods",
      "description": "Write tests for all Logger methods: Debug, Info, Warn, Error, context variants, Add* methods, Writer methods, EventReleaser methods. Use mock slog.Handler to verify correct Record construction. Test concurrent method calls. Ensure 100% coverage of Logger code.",
      "status": "Not Started"
    },
    {
      "task": "Add comprehensive unit tests for all Event methods",
      "description": "Write tests for all Event methods: Add*, Msg, Level, Time, Send. Use mock Handler to verify Attribute capture and Record emission. Test event pooling with many events. Test Reset() clears all fields. Ensure 100% coverage of Event code.",
      "status": "Not Started"
    },
    {
      "task": "Add unit tests for level mapping functions",
      "description": "Write tests for toSlogLevel and toLogifaceLevel covering: all logiface levels mapping to slog levels, all slog levels mapping to logiface levels, edge cases (TraceLevel -> DebugLevel), dynamic level handling.",
      "status": "Not Started"
    },
    {
      "task": "Add unit tests for SlogHandler methods",
      "description": "Write tests for all SlogHandler methods: Enabled returns correct boolean, Handle converts Record correctly, WithAttrs creates Handler with attrs, WithGroup creates Handler with group. Test Handler chaining and stacked attributes. Test concurrent Handle calls.",
      "status": "Not Started"
    },
    {
      "task": "Add unit tests for Record conversion in Handle",
      "description": "Write tests converting slog.Record to logiface.Event covering: basic fields (Time, Level, Message), all Value kinds (String, Int64, Float64, Bool, Duration, Time, Group, Any), nested Attrs, empty Attrs, PC extraction, source location formatting.",
      "status": "Not Started"
    },
    {
      "task": "Add unit tests for Attr grouping",
      "description": "Write tests for group handling: single WithGroup, nested WithGroup calls, mixed WithAttrs and WithGroup, group key prefix injection, group with empty name handling, group with special characters in name.",
      "status": "Not Started"
    },
    {
      "task": "Add unit tests for WithAttrs attribute accumulation",
      "description": "Write tests for WithAttrs: single WithAttrs creates Handler with attrs, multiple WithAttrs calls stack attributes, attributes appear before dynamic attributes, empty WithAttrs returns same Handler, attribute order preserved.",
      "status": "Not Started"
    },
    {
      "task": "Add unit tests for LogValuer handling",
      "description": "Write tests for LogValuer resolution: struct implementing LogValuer, pointer implementing LogValuer, nested LogValuer, circular reference detection, depth limit enforcement, error values as LogValuer.",
      "status": "Not Started"
    },
    {
      "task": "Add unit tests for context handling",
      "description": "Write tests for context propagation: context passed to Handle available in event, nil context handling, context cancellation before Handle, context values accessible in middleware, background context default.",
      "status": "Not Started"
    },
    {
      "task": "Add unit tests for event pooling",
      "description": "Write tests for event pool: NewEvent returns allocated event, ReleaseEvent returns to pool, Reset clears all fields, pool reuses events, no memory leaks with 100k events, multiple goroutines pool concurrently.",
      "status": "Not Started"
    },
    {
      "task": "Add unit tests for Enabled level filtering",
      "description": "Write tests for Enabled: returns false for levels below threshold, returns true for levels at threshold, returns true for disabled levels if Handler is always-enabled, respects dynamic level changes, handles invalid levels gracefully.",
      "status": "Not Started"
    },
    {
      "task": "Add unit tests for source location extraction",
      "description": "Write tests for PC extraction: correct file name, correct line number, incorrect PC=0 handling, PC points to correct caller depth, source location format matches slog standard.",
      "status": "Not Started"
    },
    {
      "task": "Add unit tests for ReplaceAttr hook",
      "description": "Write tests for ReplaceAttr: hook called for each attribute, can modify attribute key, can modify attribute value, can filter out attribute by returning zero, receives group prefix correctly.",
      "status": "Not Started"
    },
    {
      "task": "Add tests for error handling in Handle",
      "description": "Write tests for error scenarios: Handler.Handle returns error, nil Handler, nil Record, empty Record fields, invalid PC value, too-large attribute list causing allocation.",
      "status": "Not Started"
    },
    {
      "task": "Add tests for concurrent usage",
      "description": "Write concurrency tests: multiple goroutines calling Logger methods, multiple goroutines calling Handler.Handle, multiple goroutines pooling events, no data races under go test -race, thread-safe attribute accumulation.",
      "status": "Not Started"
    },
    {
      "task": "Add benchmarks for Logger method calls",
      "description": "Create benchmark_test.go. Add benchmarks for all Logger methods: Debug, Info, Warn, Error with and without fields, context variants. Use b.N and b.ResetTimer. Compare performance to logiface-zerolog adapter.",
      "status": "Not Started"
    },
    {
      "task": "Add benchmarks for Event field setting",
      "description": "Add benchmarks for Event methods: AddString, AddInt, AddFloat64, AddBool, AddTime, AddDuration, Any, Error field. Benchmark single field addition and multiple fields. Benchmark Send() emission.",
      "status": "Not Started"
    },
    {
      "task": "Add benchmarks for Handler Handle",
      "description": "Add benchmarks for SlogHandler.Handle: basic Record, Record with many Attrs, Record with groups, Record with LogValuer, concurrent Handle calls with multiple goroutines.",
      "status": "Not Started"
    },
    {
      "task": "Add benchmarks for event pooling",
      "description": "Add benchmarks for event pool throughput: NewEvent then ReleaseEvent loop, pool recycling efficiency, pool memory allocation compared to new Event every time.",
      "status": "Not Started"
    },
    {
      "task": "Add benchmarks for level mapping",
      "description": "Add benchmarks for level conversion: toSlogLevel, toLogifaceLevel, benchmark with hot path allocation, compare to direct function call overhead.",
      "status": "Not Started"
    },
    {
      "task": "Add benchmarks for Handler chaining",
      "description": "Add benchmarks for Handler composition: WithAttrs chaining multiple times, WithGroup chaining multiple times, combined WithAttrs and WithGroup, compare to single Handler overhead.",
      "status": "Not Started"
    },
    {
      "task": "Add benchmarks for LogValuer resolution",
      "description": "Add benchmarks for LogValuer: simple LogValuer type, nested LogValuer chain, LogValuer with expensive LogValue, depth limit enforcement overhead.",
      "status": "Not Started"
    },
    {
      "task": "Integrate with logiface-testsuite for Logger behavior",
      "description": "Modify logiface-testsuite tests to run against slog.Logger. Ensure all passing tests for logiface-zerolog also pass for logiface-slog. Investigate and fix any failing tests. Ensure 100% testsuite compliance.",
      "status": "Not Started"
    },
    {
      "task": "Run testsuite with race detector",
      "description": "Execute complete test suite with go test -race. Fix any data races found. Ensure no race conditions in Logger, Event, Handler, pool management, concurrent field access.",
      "status": "Not Started"
    },
    {
      "task": "Run testsuite with coverage report",
      "description": "Execute go test -coverprofile=coverage.out. Verify coverage is 100% for all non-test files. Identify and test any uncovered lines. Ensure no code is untested.",
      "status": "Not Started"
    },
    {
      "task": "Ensure all tests pass on all platforms (Darwin, Linux, Windows)",
      "description": "Run test suite on macOS, Linux, and Windows. Fix platform-specific issues (file paths, time formatting, PC extraction differences on Windows). Ensure 100% pass rate across all three platforms.",
      "status": "Not Started"
    },
    {
      "task": "Vet checks with go vet",
      "description": "Run go vet on entire module. Fix all issues: unreachable code, self-assignment, unreachable code, misuse of unsafe pointers, incorrect struct tags, missing new in sync.Pool Put.",
      "status": "Not Started"
    },
    {
      "task": "Create example usage documentation",
      "description": "Create example_test.go with godoc examples. Demonstrate: creating slog.Logger from logiface-slog, basic logging calls, logging with fields, logging with context, using slog.New with SlogHandler, custom slog.Handler implementation, replaceAttr hook usage.",
      "status": "Not Started"
    },
    {
      "task": "Write comprehensive package documentation in doc.go",
      "description": "Add detailed package doc in doc.go. Describe module purpose: slog.Handler adapter for logiface. Explain architecture: Handler-to-Builder bridging, event pooling, level mapping. Document all exported types and functions. Provide usage examples linking to examples_test.",
      "status": "Not Started"
    },
    {
      "task": "Create CHANGELOG.md with initial release entry",
      "description": "Create CHANGELOG.md following Keep a Changelog format. Add Unreleased section. Add initial version section with Added entries listing all features: slog.Handler adapter, SlogLogger, SlogHandler, level conversion, event pooling, AttrBuilder, FieldBuilder, JSONSupport.",
      "status": "Not Started"
    },
    {
      "task": "Add module to go.work workspace",
      "description": "Edit go.work file. Add use directive for logiface-slog module directory. Ensure module is available for import in other modules. Run go work sync to verify. Test that go get can pull the module.",
      "status": "Not Started"
    },
    {
      "task": "Verify Makefile auto-discovers logiface-slog module",
      "description": "Run gmake list-modules to verify logiface-slog appears in module list. Run gmake build.logiface-slog to verify module builds. Run gmake test.logiface-slog to verify tests run. Run gmake all to verify it participates in full build.",
      "status": "Not Started"
    },
    {
      "task": "Add module-specific Makefile targets if needed",
      "description": "If logiface-slog requires custom build targets beyond default, create Makefile in module directory. Add targets for: custom benchmark runs, special test scenarios, coverage generation. Ensure targets integrate with parent Makefile.",
      "status": "Not Started"
    },
    {
      "task": "Configure grit publishing for logiface-slog",
      "description": "Edit project.mk or grit configuration. Add logiface-slog module to grit publication list. Map local module to destination repository (e.g., github.com/joeycumines/islog). Test gmake grit.logiface-slog command works correctly.",
      "status": "Not Started"
    },
    {
      "task": "Create repository-specific files for module publication",
      "description": "Create any files needed when module is published to its own repo: LICENSE file (if different from parent), CONTRIBUTING guidelines, go.work.publish if needed. Ensure module can be imported independently after grit publish.",
      "status": "Not Started"
    },
    {
      "task": "Test module imports from other modules in monorepo",
      "description": "Import logiface-slog from eventloop, goja-eventloop, or other modules. Create integration test using slog.Logger. Verify module can be cross-imported successfully. Run go mod tidy across all affected modules.",
      "status": "Not Started"
    },
    {
      "task": "Add architecture decision to docs/adr",
      "description": "Create docs/adr/logiface-slog-design.md documenting all architectural decisions: Handler-to-Builder adaptation strategy, event pooling rationale, level mapping choices, LogValuer resolution depth limit, group prefix semantics, source location extraction method.",
      "status": "Not Started"
    },
    {
      "task": "Performance profiling and optimization",
      "description": "Use pprof to profile Logger and Handler performance. Identify hot paths. Optimize common operations: event allocation, attribute conversion, record construction. Benchmark before and after optimization. Ensure no regression.",
      "status": "Not Started"
    },
    {
      "task": "Memory leak detection",
      "description": "Run extended stress tests with high event volume. Use pprof heap profiling to check for leaks. Verify event pool returns all events. Verify no growing allocations in long-running test with 1M events.",
      "status": "Not Started"
    },
    {
      "task": "Add fuzz tests for attribute conversion",
      "description": "Create fuzz_test.go. Add fuzz target for slog.Attr to logiface field conversion covering all Value kinds. Run go test -fuzz=FuzzAttrConversion. Fix any crashes or panics from malformed inputs.",
      "status": "Not Started"
    },
    {
      "task": "Add fuzz tests for Record conversion",
      "description": "Add fuzz target for slog.Record to logiface.Event conversion. Fuzz with arbitrary Attr lists, PC values, timestamps, messages. Fix any panics from malformed Records.",
      "status": "Not Started"
    },
    {
      "task": "Validate JSON output format matches slog standard",
      "description": "Test with slog.TextHandler and slog.JSONHandler to ensure output format is correct. Verify field names and structure match slog expectations. Test output with tooling that parses slog output.",
      "status": "Not Started"
    },
    {
      "task": "Test with custom slog.Handler implementations",
      "description": "Use SlogHandler with custom slog.Handler implementations: text handler, JSON handler, multi-handler. Verify logiface-slog adapter works correctly with any valid Handler. Fix any compatibility issues.",
      "status": "Not Started"
    },
    {
      "task": "Add integration test with real slog.Logger usage",
      "description": "Create integration test mimicking real slog.Logger usage: default logger replacement, structured logging with slog.Any, slog.Group usage, context-aware logging, middleware injection. Verify all slog patterns work through adapter.",
      "status": "Not Started"
    },
    {
      "task": "Test slog.Group handling in fields",
      "description": "Add tests for slog.Group() usage: nested groups, groups with LogValuer, empty groups, groups with same name. Ensure groups are converted to proper JSON structure. Verify group semantics match slog.Group documentation.",
      "status": "Not Started"
    },
    {
      "task": "Test error handling with slog.ErrorHandler",
      "description": "Test interaction with error handlers. Verify that errors in Record conversion or Handler emission are reported correctly. Test panic recovery in Handle method. Test error propagation to caller.",
      "status": "Not Started"
    },
    {
      "task": "Add test for large attribute list handling",
      "description": "Test with 100+ attributes on a single event. Test with 1000+ attributes. Verify correct handling and no buffer overflows. Ensure performance scales reasonably with attribute count.",
      "status": "Not Started"
    },
    {
      "task": "Add test for deep nesting in Attr groups",
      "description": "Test with 10+ levels of nested groups. Test WithGroup chained 10 times. Verify correct key prefix generation with deep nesting. Ensure no overflow or incorrect prefix joining.",
      "status": "Not Started"
    },
    {
      "task": "Add test for special characters in keys and group names",
      "description": "Test with special characters: spaces, Unicode, emoji, control characters. Verify special characters are handled correctly in key prefixes. Ensure JSON serialization preserves characters.",
      "status": "Not Started"
    },
    {
      "task": "Add test for nil and zero value handling",
      "description": "Test with nil context, empty Attr list, zero time.Time, nil error, empty string, zero values for numeric types. Verify graceful handling and no panics.",
      "status": "Not Started"
    },
    {
      "task": "Add test for Handler method error returns",
      "description": "Test that errors from Handler.Handle are returned correctly. Test with Handler that always errors. Test partial success in multi-handler. Verify error is not swallowed.",
      "status": "Not Started"
    },
    {
      "task": "Add test for concurrent Logger level changes",
      "description": "Test changing configured level while many goroutines are logging. Verify no race or level mismatch. Verify Enabled() sees new level atomically.",
      "status": "Not Started"
    },
    {
      "task": "Add test for context cancellation during logging",
      "description": "Test logging with context already canceled. Test logging with context that cancels during processing. Verify behavior is graceful: log may or may not emit depending on cancellation timing.",
      "status": "Not Started"
    },
    {
      "task": "Add test for very long message strings",
      "description": "Test with extremely long messages (1MB+). Verify message is logged correctly. Test memory allocation with large strings. Ensure no truncation.",
      "status": "Not Started"
    },
    {
      "task": "Add test for repeated field key names",
      "description": "Test adding same field key multiple times. Last value wins or both values appear depending on slog behavior. Verify expected handling of duplicate keys.",
      "status": "Not Started"
    },
    {
      "task": "Add test for timestamp precision",
      "description": "Test timestamp nanosecond precision. Test timestamps in different timezones. Verify times are logged correctly from Event. Time zone handling in output.",
      "status": "Not Started"
    },
    {
      "task": "Add test for interface{} Any field type handling",
      "description": "Test Any with various types: struct, map, slice, nil, pointer, custom type. Verify slog.Value.Any handles each correctly. Verify JSON serialization works.",
      "status": "Not Started"
    },
    {
      "task": "Add test for ReplaceAttr filtering",
      "description": "Test ReplaceAttr hook that returns zero attr to filter out sensitive fields. Verify filtered fields do not appear in output. Test filtering based on key prefix.",
      "status": "Not Started"
    },
    {
      "task": "Add test for ReplaceAttr attribute modification",
      "description": "Test ReplaceAttr hook that redacts values. Test hook that adds hash to values. Test hook that transforms data types. Verify modifications appear in final output.",
      "status": "Not Started"
    },
    {
      "task": "Add test for Source location with embedded Handler",
      "description": "Test when logiface-slog is used with another slog.Handler. Verify source location is added with correct PC after Handler transformation. Verify stack depth calculation is correct.",
      "status": "Not Started"
    },
    {
      "task": "Add test for Handler equality testing",
      "description": "Test that two Handlers with same options are equal or behave identically. Test that Handlers with different options are not equal. Verify WithAttrs creates new Handler instance, not same reference.",
      "status": "Not Started"
    },
    {
      "task": "Add test for logger configuration immutability",
      "description": "Verify that Logger returned from WithAttrs does not modify original Logger. Test that WithGroup does not modify parent Handler. Ensure configuration is immutable.",
      "status": "Not Started"
    },
    {
      "task": "Add test for pool reuse after many Send() calls",
      "description": "Test pool after 10,000 Send() calls. Verify events come back from pool, not new allocations. Test memory allocation stays bounded with repeated operations.",
      "status": "Not Started"
    },
    {
      "task": "Add test for field builder lazy evaluation",
      "description": "Test Field.String with function parameter. Test Field.Int with callback. Verify lazy evaluation happens during log emission, not log construction. Test error handling in lazy eval.",
      "status": "Not Started"
    },
    {
      "task": "Add test for JSON support methods",
      "description": "Test CanAddRawJSON, CanAddFields, CanAddLazyFields. Verify all return true. Test that all three feature types work correctly. Test mixed usage of JSON, fields, lazy fields.",
      "status": "Not Started"
    },
    {
      "task": "Add test for AddRawJSON with invalid JSON",
      "description": "Test AddRawJSON with malformed JSON. Test with JSON that is not an object. Verify error handling. Verify panic or corruption prevention.",
      "status": "Not Started"
    },
    {
      "task": "Add test for Errs multiple errors",
      "description": "Test Errs field with multiple errors. Test with nil errors. Test with wrapped errors. Verify all errors are logged correctly.",
      "status": "Not Started"
    },
    {
      "task": "Add test for concurrent Modify same event",
      "description": "Test two goroutines adding fields to same Event concurrently. Verify behavior is either safe access or race detection. Prefer safe access through mutex if needed.",
      "status": "Not Started"
    },
    {
      "task": "Add test for Enabled in goroutine hot path",
      "description": "Test Enabled called from many goroutines concurrently. Verify no data race. Verify return value is consistent for same level.",
      "status": "Not Started"
    },
    {
      "task": "Verify no build warnings",
      "description": "Run go build logiface-slog/... and ensure zero warnings. Fix any warnings about unused variables, deprecated usage, inefficient patterns.",
      "status": "Not Started"
    },
    {
      "task": "Verify no staticcheck issues",
      "description": "Run staticcheck on logiface-slog module. Fix all issues: SA series about code quality, ST about concurrency complexity, errcheck errors. Ensure zero issues.",
      "status": "Not Started"
    },
    {
      "task": "Verify nilsafe methods throughout module",
      "description": "Audit all exported methods handle nil inputs gracefully. Add tests for nil context, nil handler, nil logger options. Ensure no nil pointer panics on public API.",
      "status": "Not Started"
    },
    {
      "task": "Add godoc comments for all exported types",
      "description": "Review all exported types (Event, Logger, SlogHandler, Field, Option). Add comprehensive godoc comments with descriptions and usage examples.",
      "status": "Not Started"
    },
    {
      "task": "Add godoc comments for all exported functions",
      "description": "Review all exported functions (NewLogger, NewSlogHandler, toSlogLevel, toLogifaceLevel, WithAttributes, WithGroup, WithLevel, WithReplaceAttr). Add godoc comments with parameter descriptions.",
      "status": "Not Started"
    },
    {
      "task": "Add godoc comments for all exported methods",
      "description": "Review all exported methods on Event, Logger, SlogHandler types. Add godoc comments with descriptions, parameter types, return values, and behavioral notes.",
      "status": "Not Started"
    },
    {
      "task": "Add godoc examples in code",
      "description": "Add // Example: and // ExampleNewLogger: style examples in code. Ensure examples are complete runnable snippets. Verify go test -run Examples passes.",
      "status": "Not Started"
    },
    {
      "task": "Create module README.md",
      "description": "Create README.md in logiface-slog/. Include: module description, installation (go get), quick start example, features list, compatibility notes (slog version requirements), performance notes, links to godoc and examples.",
      "status": "Not Started"
    },
    {
      "task": "Update CLAUDE.md with logiface-slog module entry",
      "description": "Add logiface-slog to the Key Modules section in CLAUDE.md. Describe purpose: slog.Handler adapter for logiface. Note it follows logiface-zerolog pattern. Document usage with slog standard library.",
      "status": "Not Started"
    },
    {
      "task": "Final verification: all tests pass with race detector on all platforms",
      "description": "Run complete test suite with go test -race on macOS, Linux, Windows. Ensure 100% pass rate. Fix any remaining platform-specific issues. No race conditions allowed.",
      "status": "Not Started"
    },
    {
      "task": "Final verification: 100% code coverage",
      "description": "Run go test -cover. Verify coverage is 100% for all non-test files. Identify and test any uncovered lines. Do not accept coverage below 100%.",
      "status": "Not Started"
    },
    {
      "task": "Final verification: no lint or static analysis issues",
      "description": "Run full lint suite: go vet, staticcheck, any project-specific checks. Ensure zero issues. Fix all warnings before marking complete.",
      "status": "Not Started"
    },
    {
      "task": "Final verification: all benchmarks run successfully",
      "description": "Run go test -bench=. -benchmem. Ensure all benchmarks complete. Verify no panics or crashes. Check benchmark results are reasonable.",
      "status": "Not Started"
    },
    {
      "task": "Final verification: testsuite compliance",
      "description": "Run logiface-testsuite against logiface-slog one last time. Ensure all tests pass. Compare results to logiface-zerolog implementation parity.",
      "status": "Not Started"
    },
    {
      "task": "Final verification: integration with goja-eventloop",
      "description": "If goja-eventloop should use logiface-slog, verify integration works. Test slog usage within goja-eventloop context. Verify no conflicts or performance regressions.",
      "status": "Not Started"
    },
    {
      "task": "Final verification: grit publish test run (dry-run)",
      "description": "Test that gmake grit.logiface-slog would work correctly. Verify module structure is ready for publication. Ensure all files are committed and versioned.",
      "status": "Not Started"
    },
    {
      "task": "Document and verify all edge cases handled",
      "description": "Create list of all edge cases identified and tested: nil context, empty records, invalid PC, special chars, huge messages, deep nesting, duplicate keys, zero values, concurrent access, disabled levels. Verify each has comprehensive test passing.",
      "status": "Not Started"
    },
    {
      "task": "Performance regression check against logiface-zerolog",
      "description": "Compare benchmarks of logiface-slog vs logiface-zerolog when used in goja-eventloop. Ensure performance is within acceptable tolerance (no more than 20% slower). Document any performance differences.",
      "status": "Not Started"
    },
    {
      "task": "Final review of all code for idiomatic Go patterns",
      "description": "Review entire codebase for: correct error handling, defer usage, interface implementation patterns, naming conventions, comment quality, code organization. Refactor for idiomatic cleanliness where needed.",
      "status": "Not Started"
    },
    {
      "task": "Ensure all TODO comments resolved or justified",
      "description": "Search for TODO, FIXME, XXX, HACK comments. Either resolve the issue or add inline comment explaining why deferred. No unresolved TODOs without justification.",
      "status": "Not Started"
    },
    {
      "task": "Verify package imports are minimal and no unused imports",
      "description": "Run goimports on all files. Remove unused imports. Ensure import order is standard. Verify package dependencies are minimal and necessary.",
      "status": "Not Started"
    },
    {
      "task": "Final cross-platform verification: macOS",
      "description": "Run full test build/test on macOS environment. Verify all tests pass, race detector passes, benchmarks run, coverage is 100%. Fix any macOS-specific issues.",
      "status": "Not Started"
    },
    {
      "task": "Final cross-platform verification: Linux",
      "description": "Run full test build/test on Linux environment. Verify all tests pass, race detector passes, benchmarks run, coverage is 100%. Fix any Linux-specific issues (file paths, threading).",
      "status": "Not Started"
    },
    {
      "task": "Final cross-platform verification: Windows",
      "description": "Run full test build/test on Windows environment. Verify all tests pass, race detector passes, benchmarks run, coverage is 100%. Fix any Windows-specific issues (file paths, stack frames).",
      "status": "Not Started"
    },
    {
      "task": "Verify module can be imported by external consumers",
      "description": "Create external test project that imports logiface-slog using go get. Verify module can be fetched and used. Verify version compatibility. Fix any import or module path issues.",
      "status": "Not Started"
    },
    {
      "task": "Verify semantic versioning requirements",
      "description": "If module will be published, verify go.mod has correct version. Ensure API changes are versioned appropriately. Verify minimum Go version is correctly specified.",
      "status": "Not Started"
    },
    {
      "task": "Verify CHANGELOG.md is complete and accurate",
      "description": "Review CHANGELOG.md for completeness. Ensure all features are documented. Compare to actual code. Fix discrepancies. Add upgrade notes if needed.",
      "status": "Not Started"
    },
    {
      "task": "Verify godoc is helpful and builds correctly",
      "description": "Build godoc for logiface-slog. Check that all packages and symbols appear. Verify examples render correctly. Fix any godoc rendering issues.",
      "status": "Not Started"
    },
    {
      "task": "Complete and verify blueprint.json task list is exhaustive",
      "description": "Review blueprint tasks one final time. Add any missed tasks. Ensure every aspect of implementation, testing, documentation, integration is covered. No omitted tasks allowed.",
      "status": "Not Started"
    },
    {
      "task": "Rule of Two verification: First subagent review",
      "description": "Invoke subagent to review entire logiface-slog module. Instruct it to be skeptical and find all issues. Read every word of the review. Fix every issue raised.",
      "status": "Not Started"
    },
    {
      "task": "Rule of Two verification: Second subagent review",
      "description": "Invoke new subagent to review the fixed state after first review. Instruct it to verify no issues remain and code cannot be improved. Read every word of the review. Only proceed if perfect.",
      "status": "Not Started"
    }
  ],
  "continuousVerification": {
    "task": "Run 'make all' with full logging after EVERY significant change",
    "description": "Execute 'make make-all-with-log' after: (a) Each code change, (b) Each test addition, (c) Each task completion, (d) Each bug fix.",
    "failPolicy": "If ANY test fails, STOP IMMEDIATELY and fix the issue before proceeding. Zero tolerance for test failures, timing issues, non-determinism, or race conditions.",
    "testCoverage": "You will ALWAYS aim for 100% effective test coverage, and VERIFY test coverage by means of the tooling available to you. You will NOT proceed to the next task until you have achieved 100% effective test coverage for the current task, and have verified that coverage with the tools available to you."
  },
  "finalEnforcementProtocol": [
    {
      "type": "POST_EXECUTION_WARNING",
      "alert": "ON TOOLS: Use `config.mk` to create custom targets to run with Make. ALWAYS use custom targets that *limit* the amount of output you receive. For example, piping through tail, with FEW lines output. Prior to tail, pipe to tee. The file ./build.log in the root of the project is gitignored, so use that. That way you can *search* the output. To be clear, timing dependent tests are BANNED. As are those that take too long to run. Testing retries, for example, MUST be done in a way that supports avoiding running afoul of those CRITICAL rules. Abide. OBEY."
    },
    {
      "type": "POST_EXECUTION_WARNING_REPEATED",
      "alert": "ON TOOLS: Use `config.mk` to create custom targets to run with Make. ALWAYS use custom targets that *limit* the amount of output you receive. For example, piping through tail, with FEW lines output. Prior to tail, pipe to tee. The file ./build.log in the root of the project is gitignored, so use that. That way you can *search* the output. To be clear, timing dependent tests are BANNED. As are those that take too long to run. Testing retries, for example, MUST be done in a way that supports avoiding running afoul of those CRITICAL rules. Abide. OBEY."
    }
  ]
}
